Enterprise_Serivces/Prod/Bronze4/CSLRealmUserService/result1/Iteration1/t4_http.xml

<?xml-stylesheet href="..\http.xsl" type="text/xsl"?>
<report vuGenInstallDir="C:\Program Files (x86)\HP\LoadRunner\">
  <http>
    <request>
      <header>POST /RealmUserService.svc HTTP/1.1
Content-Type: text/xml; charset=utf-8
Cache-Control: no-cache
SOAPAction: "http://www.gamestop.com/services/core/contracts/2010/05/IServiceBase/GetVersion"
User-Agent: Mozilla/4.0 (compatible; MSIE 6.0; MS Web Services Client Protocol 1.1.4322.2032)
Accept-Encoding: gzip, deflate
Accept: */*
Connection: Keep-Alive
Host: cslrealmuserserviceqa1.testgs.pvt
Content-Length: 783

</header>
      <body>&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"&gt;
  &lt;soap:Header&gt;
    &lt;wsa:Action&gt;http://www.gamestop.com/services/core/contracts/2010/05/IServiceBase/GetVersion&lt;/wsa:Action&gt;
    &lt;wsa:MessageID&gt;uuid:60215331-7a53-4ea2-918e-277b09da4f60&lt;/wsa:MessageID&gt;
    &lt;wsa:ReplyTo&gt;
      &lt;wsa:Address&gt;http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous&lt;/wsa:Address&gt;
    &lt;/wsa:ReplyTo&gt;
    &lt;wsa:To&gt;http://cslrealmuserserviceqa1.testgs.pvt/RealmUserService.svc&lt;/wsa:To&gt;
  &lt;/soap:Header&gt;
  &lt;soap:Body&gt;
    &lt;GetVersion xmlns="http://www.gamestop.com/services/core/contracts/2010/05" /&gt;
  &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt;</body>
    </request>
    <response>
      <header>HTTP/1.1 200 OK
Content-Length: 243
Content-Type: text/xml; charset=utf-8
Server: Microsoft-IIS/8.5
Date: Mon, 30 Jan 2017 17:16:59 GMT

</header>
      <body>&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;s:Body&gt;
    &lt;GetVersionResponse xmlns="http://www.gamestop.com/services/core/contracts/2010/05"&gt;
      &lt;GetVersionResult&gt;1.0.0.0&lt;/GetVersionResult&gt;
    &lt;/GetVersionResponse&gt;
  &lt;/s:Body&gt;
&lt;/s:Envelope&gt;</body>
    </response>
  </http>
</report>